#!/bin/sh

echo 'السلام عليكم و رحمة الله و بركاته'
echo '-----------------------------'

array=(
'من قال في القرآن برأيِهِ فقداخطأَ و إن أَصاب'
'إشتدي يا أزمة تنفرجي'
'استنزلوا الرزق بالصدقة'
'إتق الله حيثما كنت'
'أغنى الناس من قنع بما تيسر له'
'أقوى الناس من قوي على عضبه'
'التصرف أثناء الغضب كالإبحار خلال العاصفة'
'الخيل أعلم بفرسانها'
'الصبر مفتاح الفرج'
'الصغائر بمرور الزمن تصير كبائر'
'الكتب بساتين العقلاء'
'اللهم ألهمني رشدي وقني شر نفسي'
'اللهم أهدني لأحسن الأعمال والأخلاق'
'اللهم حبب إلينا الإيمان وزينه في قلوبنا'
'اللهم من أراد المسلمين بسوء فأشغله في نفسه'
'الناس أعداء ما جهلوا'
'الوحدة خير من جليس السوء'
'تموت الاشجار وهي واقفة'
'ثواب الآخرة خير من نعيم الدنيا'
'جودة الكلام في الاختصار'
'خفّف طعامك ، تحمد منامك'
'رب أخ لك لم تلده أمك'
'رجل بلا مال خير من رجل بلا شرف'
 'Nobody listens until you say something wrong'
 )
randArrayElement(){ arr=("${!1}"); echo ${arr["$[RANDOM % ${#arr[@]}]"]}; }
randArrayElement "array[@]"
